Revit 2026 API

# GeometryCreationUtilitiesCreateLoftGeometry Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Solid CreateLoftGeometry(
	IList<CurveLoop> profileLoops,
	SolidOptions solidOptions
)
```
```vb
Public Shared Function CreateLoftGeometry (
	profileLoops As IList(Of CurveLoop),
	solidOptions As SolidOptions
) As Solid
```
```cpp
public:
static Solid^ CreateLoftGeometry(
	IList<CurveLoop^>^ profileLoops,
	SolidOptions^ solidOptions
)
```
```fsharp
static member CreateLoftGeometry :
        profileLoops : IList<CurveLoop> *
        solidOptions : SolidOptions -> Solid
```

#### Parameters

profileLoops IListCurveLoop

solidOptions SolidOptions

#### Return Value

Solid

#### Reference

GeometryCreationUtilities Class

Autodesk.Revit.DB Namespace